cfg/Tasks/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Task>
		<Properties>
			<Name>Задачи</Name>
			<Addressing>InformationRegister.РолиИИсполнители</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадачПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЗадачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияРазовыхУдержанийРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаСверхурочныхЧасов</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.Сторнирование</v8:Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НевыходыВОрганизациях</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОтпускаРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПраздничныхИВыходныхДнейОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПремииРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияРазовыхНачисленийРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РасчетПриУвольненииРаботникаОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияПростоевВОрганизациях</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:DocumentRef.КомандировкиОрганизаций</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЕдиновременныхПособийЗаСчетФСС</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтсутствиеНаРаботеОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускаОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереносДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаРабочегоВремениОрганизации</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

cfg/InformationRegisters/РолиИИсполнители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РолиИИсполнители</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Tasks/Задачи/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем Исполнитель;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ОбновитьНадписьАктуальности()
	
	ДатаАктуальности = Константы.ДатаАктуальностиЗадач.Получить();
	
	Сегодня				= ТекущаяДата();
	Вчера				= КонецДня(ОбщегоНазначения.ДобавитьИнтервал(Сегодня, Перечисления.Периодичность.День, -1));
	Позавчера			= КонецДня(ОбщегоНазначения.ДобавитьИнтервал(Сегодня, Перечисления.Периодичность.День, -2));
	ДнейНазад3			= КонецДня(ОбщегоНазначения.ДобавитьИнтервал(Сегодня, Перечисления.Периодичность.День, -3));
	ДнейНазад4			= КонецДня(ОбщегоНазначения.ДобавитьИнтервал(Сегодня, Перечисления.Периодичность.День, -4));
	ДнейНазад5			= КонецДня(ОбщегоНазначения.ДобавитьИнтервал(Сегодня, Перечисления.Периодичность.День, -5));
	ДнейНазад6			= КонецДня(ОбщегоНазначения.ДобавитьИнтервал(Сегодня, Перечисления.Периодичность.День, -6));
	НедельНазад1		= КонецДня(ОбщегоНазначения.ДобавитьИнтервал(Сегодня, Перечисления.Периодичность.Неделя, -1));
	НедельНазад2		= КонецДня(ОбщегоНазначения.ДобавитьИнтервал(Сегодня, Перечисления.Периодичность.Неделя, -2));
	НедельНазад3		= КонецДня(ОбщегоНазначения.ДобавитьИнтервал(Сегодня, Перечисления.Периодичность.Неделя, -3));
	МесяцНазад1			= КонецДня(ДобавитьМесяц(Сегодня, -1));
	МесяцНазад2			= КонецДня(ДобавитьМесяц(Сегодня, -2));
	
	Если Не ЗначениеЗаполнено(ДатаАктуальности) Тогда
		Текст = "Задачи не обновлялись";
		
	ИначеЕсли МесяцНазад1 >= ДатаАктуальности И ДатаАктуальности > МесяцНазад2 Тогда
		Текст = "Месяц назад";
		
	ИначеЕсли НедельНазад3 >= ДатаАктуальности И ДатаАктуальности > МесяцНазад1 Тогда
		Текст = "3 недели назад";
		
	ИначеЕсли НедельНазад2 >= ДатаАктуальности И ДатаАктуальности > НедельНазад3 Тогда
		Текст = "2 недели назад";
		
	ИначеЕсли НедельНазад1 >= ДатаАктуальности И ДатаАктуальности > НедельНазад2 Тогда
		Текст = "Неделю назад";
		
	ИначеЕсли ДатаАктуальности <= ДнейНазад6 Тогда
		Текст = ""+Перечисления.ДниНедели[ДеньНедели(ДатаАктуальности)-1]+", " + Формат(ДатаАктуальности, "ДФ='д ММММ'");
		
	ИначеЕсли ДатаАктуальности <= ДнейНазад5 Тогда
		Текст = ""+Перечисления.ДниНедели[ДеньНедели(ДатаАктуальности)-1]+", " + Формат(ДатаАктуальности, "ДФ='д ММММ'");
		
	ИначеЕсли ДатаАктуальности <= ДнейНазад4 Тогда
		Текст = ""+Перечисления.ДниНедели[ДеньНедели(ДатаАктуальности)-1]+", " + Формат(ДатаАктуальности, "ДФ='д ММММ'");
		
	ИначеЕсли ДатаАктуальности <= ДнейНазад3 Тогда
		Текст = ""+Перечисления.ДниНедели[ДеньНедели(ДатаАктуальности)-1]+", " + Формат(ДатаАктуальности, "ДФ='д ММММ'");
		
	ИначеЕсли ДатаАктуальности <= Позавчера Тогда
		Текст = "Позавчера, " + Формат(ДатаАктуальности, "ДФ='д ММММ'");
		
	ИначеЕсли ДатаАктуальности <= Вчера Тогда
		Текст = "Вчера, " + Формат(ДатаАктуальности, "ДФ='д ММММ'");
		
	ИначеЕсли ДатаАктуальности <= Сегодня Тогда
		Текст = "Сегодня,";
		
		РазностьДат = Дата(1, 1, 1) + (Сегодня - ДатаАктуальности);
		Часов	= Час(РазностьДат);
		Минут	= Минута(РазностьДат);
		
		Если РазностьДат < Дата(1, 1, 1, 0, 1, 0) Тогда
			Текст = Текст + " меньше минуты";
			
		Иначе
			Если Часов > 0 Тогда
				Текст = Текст + " " + Часов + ОбщегоНазначения.ФормаМножественногоЧисла(" час", " часа", " часов", Часов);
			КонецЕсли;
			Если Минут > 0 Тогда
				Текст = Текст + " " + Минут + ОбщегоНазначения.ФормаМножественногоЧисла(" минуту", " минуты", " минут", Минут);
			КонецЕсли;
			
		КонецЕсли;
		
		Текст = Текст + " назад";
		
	ИначеЕсли ДатаАктуальности > Сегодня Тогда
		Текст = "В будущем";
		
	Иначе
		Текст = "Совсем давно";
		
	КонецЕсли;
	
	ЭлементыФормы.НадписьДатаВремяАктуальности.Значение = Текст;
	
КонецПроцедуры

Процедура ОбработчикОбновления()
	
	ОбновитьНадписьАктуальности();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ЭлементыФормы.ЗадачаСписок.Исполнитель			= Исполнитель;
	ЭлементыФормы.НастройкаСпискаЗадач.Видимость	= ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.РолиИИсполнители);
	
	Если СокрЛП(Исполнитель.Код) = "<Не указан>" Тогда
		ЭлементыФормы.НадписьТекущийПользователь.Заголовок = НСтр("ru='Мои задачи';uk='Мої задачі'");
	Иначе
		ЭлементыФормы.НадписьТекущийПользователь.Заголовок = "Мои задачи (" + Строка(Исполнитель) + ")";
	КонецЕсли;
	
	// Установка отбора по умолчанию
	ЗадачаСписок.Отбор.Выполнена.Использование = Истина;
	ЗадачаСписок.Отбор.Выполнена.ВидСравнения  = ВидСравнения.Равно;
	ЗадачаСписок.Отбор.Выполнена.Значение      = Ложь;
	
	ОбновитьНадписьАктуальности();
	ЭтаФорма.ПодключитьОбработчикОжидания("ОбработчикОбновления", 60);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

Процедура ВыполнитьЗадачу(Кнопка)
	
	ДанныеСтроки = ЭлементыФормы.ЗадачаСписок.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеЗадачами.ВыполнитьВыбраннуюЗадачу(ДанныеСтроки.Ссылка);
	
КонецПроцедуры

Процедура ОткрытьЗадачу(Кнопка)
	
	ДанныеСтроки = ЭлементыФормы.ЗадачаСписок.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки.Ссылка.ПолучитьФорму().Открыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура НастройкаСпискаЗадачНажатие(Элемент)
	
	Регистрысведений.РолиИИсполнители.ПолучитьФормуСписка().Открыть();
	
КонецПроцедуры

Процедура НастройкаСпискаЗадач1Нажатие(Элемент)
	
	Справочники.ВидыЗадачПользователей.ПолучитьФормуСписка().Открыть();
	
КонецПроцедуры

Процедура ОбновитьНажатие(Элемент)
	
	УправлениеЗадачами.СформироватьСписокЗадач();
	ЗадачаСписок.Обновить();
	ОбновитьНадписьАктуальности();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ ЗадачаСписок

Процедура ЗадачаСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УправлениеЗадачами.ВыполнитьВыбраннуюЗадачу(ВыбраннаяСтрока);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

Исполнитель = глЗначениеПеременной("глТекущийПользователь");
